'use strict';

/*
#1
Усі класи розкласти по своїм файлам і імпортувати! Наприклад, клас Human має бути в окремому файлі Human.js

a) Створити клас Людина.
  Властивості:
    імʼя;
    стать.
  Методи:
    конструктор, який приймає два параметри: імʼя та стать.

b) Створити клас Квартира.
  Властивості:
    конструктор не потрібен;
    масив жителів, який при створенні пустий.
  Методи:
    додати жителя - метод повинен приймати екземпляр класу Людина, та додавати до масиву жителів.

c) Створити клас Будинок.

  Властивості:
    масив квартир, який при створенні пустий;
    максимальна кількість квартир.
  Методи:
    конструктор, який приймає один параметр: максимальну кількість квартир;
    додати квартиру - метод повинен приймати екземпляр класу Квартира, перевіряти, чи не буде кількість перевищувати максимальну кількість квартир, і якщо це так, додати квартиру, в іншому випадку виводить у консоль відповідне повідомлення.

d) В якості демонстраціїї створити:
  декілька екземплярів класу Людина;
  декілька екземплярів класу Квартира;
  додадити екземпляри класу Людина до екземплярів класу Квартира;
  екземпляр класу Будинок;
  додадити екземпляри класу Квартира до екземплярів класу Будинок.
*/

import {Human} from "./human.js";
import {Apartment} from "./apartment.js";
import {Building} from "./building.js";


const human1 = new Human('Олександр', 'чоловік');
const human2 = new Human('Марія', 'жінка');
const human3 = new Human('Іван', 'чоловік');

const apartment1 = new Apartment();
const apartment2 = new Apartment();

apartment1.addResidents(human1);
apartment2.addResidents(human2);
apartment1.addResidents(human1);

const building = new Building(2);
building.addApartment(apartment1);
building.addApartment(apartment2);

console.log(building);





